app/controllers/admin/posts_controller.rb

SELECT * FROM `posts` WHERE (posted_at <= NOW()) ORDER BY posted_at desc
---
  def index
    @posts = Post.all

UPDATE `posts` SET `updated_at` = '2009-12-07 15:59:49', `posted_at` = '2009-11-20 00:00:00' WHERE `id` = 1
---
  def update
    if @post.update_attributes(params[:post])