app/controllers/admin/supporters_controller.rb

  def index
    @supporters = Supporter.all(:order => "created_at asc")
---
SELECT * FROM "supporters" ORDER BY created_at desc

  def create
    @supporter = Supporter.new(params[:supporter])
    if @supporter.save
---
INSERT INTO `supporters` (`name`, `company`, `comment`, `logo_updated_at`, `created_at`, `updated_at`, `logo_file_name`, `website`, `logo_content_type`, `logo_file_size`, `email`) VALUES('Noctivity', 'Noctivity', '', '2009-12-16 21:59:26', '2009-12-16 21:59:27', '2009-12-16 21:59:27', 'logo.gif', 'http://www.noctivity.com/', 'image/gif', 1459, 'support@email.com')

  def destroy
    @supporter.destroy
---
DELETE FROM `supporters` WHERE `id` = 7