app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (posted_at <= 'Mon Dec 07 11:01:20 -0500 2009') ORDER BY posted_at desc
SELECT * FROM `supporters` WHERE (logo_file_name IS NOT NULL)
---
  def index
    #@posts = Post.active[0..10] unless params[:all]
    @posts = Post.all
     @supporters = Supporter.all