app/controllers/supporters_controller.rb

  def create
    @supporter = Supporter.new(params[:supporter])
    if @supporter.save
---
INSERT INTO "supporters" ("name", "company", "comment", "logo_updated_at", "created_at", "updated_at", "logo_file_name", "website", "logo_content_type", "logo_file_size", "email") VALUES('Joshua Lippiner', 'Noctivity Inc.', '', '2009-11-30 23:11:03', '2009-11-30 23:11:04', '2009-11-30 23:11:04', 'logo.gif', 'www.noctivity.com', 'image/gif', 1459, 'jlippiner@noctivity.com')